InformationRegisters/ДополнительныеНастройкиУправленияПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеНастройкиУправленияПерсоналом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопустимыйПерерывВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияДопустимогоПерерываВРаботе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/НастройкиУправленияПерсоналом/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.102";
	Обработчик.Процедура = "РегистрыСведений.ДополнительныеНастройкиУправленияПерсоналом.УстановитьДопустимыйПерерывВРаботе";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("103f6bf0-9217-4de7-adc9-5f0d0094b0c9");
	Обработчик.Комментарий = НСтр("ru = 'Установка допустимого перерыва в работе по умолчанию.'");
	
КонецПроцедуры

#КонецОбласти

Функция ДопустимыйПерерывРаботы(ДатаНачалаРаботы, ДатаОкончанияРаботы) Экспорт
	
	ДополнительныеНастройкиУправленияПерсоналом = РегистрыСведений.ДополнительныеНастройкиУправленияПерсоналом.ЗначенияНастроек();
	ДопустимыйПерерывРаботы = ДополнительныеНастройкиУправленияПерсоналом.ДопустимыйПерерывВРаботе;
	ЕдиницаИзмеренияДопустимогоРазрываСтажа = ДополнительныеНастройкиУправленияПерсоналом.ЕдиницаИзмеренияДопустимогоПерерываВРаботе;
	ПерерывРаботы = ПерерывРаботы(ДатаНачалаРаботы, ДатаОкончанияРаботы, ЕдиницаИзмеренияДопустимогоРазрываСтажа);
	
	Если ДопустимыйПерерывРаботы >= ПерерывРаботы Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ДопустимыйПерерывРаботыВДнях() Экспорт
	
	ДополнительныеНастройкиУправленияПерсоналом = РегистрыСведений.ДополнительныеНастройкиУправленияПерсоналом.ЗначенияНастроек();
	ДопустимыйПерерывРаботы = ДополнительныеНастройкиУправленияПерсоналом.ДопустимыйПерерывВРаботе;
	ЕдиницаИзмеренияДопустимогоРазрываСтажа = ДополнительныеНастройкиУправленияПерсоналом.ЕдиницаИзмеренияДопустимогоПерерываВРаботе;
	
	Если ЕдиницаИзмеренияДопустимогоРазрываСтажа = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ДопустимыйПерерывРаботыВДнях = ДопустимыйПерерывРаботы * 364;
	ИначеЕсли ЕдиницаИзмеренияДопустимогоРазрываСтажа = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ДопустимыйПерерывРаботыВДнях = ДопустимыйПерерывРаботы * 30;
	Иначе
		ДопустимыйПерерывРаботыВДнях = ДопустимыйПерерывРаботы;
	КонецЕсли;
	
	Возврат ДопустимыйПерерывРаботыВДнях;
	
КонецФункции

Функция ПерерывРаботы(ДатаНачалаРаботы, ДатаОкончанияРаботы, ЕдиницаИзмеренияДопустимогоРазрываСтажа) Экспорт
	
	ДатаНачала = ?(ДатаНачалаРаботы < ДатаОкончанияРаботы, ДатаНачалаРаботы, ДатаОкончанияРаботы);
	ДатаОкончания = ?(ДатаНачалаРаботы < ДатаОкончанияРаботы, ДатаОкончанияРаботы, ДатаНачалаРаботы);
	
	Если ЕдиницаИзмеренияДопустимогоРазрываСтажа = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ДатаНачалаГод = Год(ДатаНачала);
		ДатаОкончанияГод = Год(ДатаОкончания);
		ПерерывРаботы = ДатаОкончанияГод - ДатаНачалаГод
			+ ?(Дата(ДатаОкончанияГод, Месяц(ДатаНачала), День(ДатаНачала))
			> НачалоДня(ДатаОкончания), -1, 0);
	ИначеЕсли ЕдиницаИзмеренияДопустимогоРазрываСтажа = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ДатаНачалаГод = Год(ДатаНачала);
		ДатаОкончанияГод = Год(ДатаОкончания);
		ДатаНачалаМесяц = Месяц(ДатаНачала);
		ДатаОкончанияМесяц = Месяц(ДатаОкончания);
		ПерерывРаботыГод = ДатаОкончанияГод - ДатаНачалаГод;
		ПерерывРаботыМесяц = ДатаОкончанияМесяц - ДатаНачалаМесяц;
		ПерерывРаботы = (ПерерывРаботыГод * 12) + ПерерывРаботыМесяц
			+ ?(Дата(ДатаОкончанияГод, ДатаОкончанияМесяц, День(ДатаНачала))
			> НачалоДня(ДатаОкончания), -1, 0);
	Иначе
		ПерерывРаботы = (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24);
	КонецЕсли;
	
	Возврат ПерерывРаботы;
	
КонецФункции

#КонецОбласти
